onepas/cc3220-examples/rtos/CC3220SF_LAUNCHXL/demos/local_ota/local_ota_task.c
    /* Start Simplelink - Blocking mode */
    mode = sl_Start(0, 0, 0);
    if (SL_ERROR_CALIB_FAIL == mode)    /* when calibration fails, reboot is required */
    {
        mcuReboot();
    }
    else
    {
        if (SL_RET_CODE_DEV_ALREADY_STARTED != mode)
        {
            ASSERT_ON_ERROR(mode);
        }
    }

    /* If the device is not in AP mode, try configuring it in AP mode 
     in case device is already started (got SL_RET_CODE_DEV_ALREADY_STARTED error code), then mode would remain -1 and in this case we do not know the role. Move to AP role anyway    */
    if (ROLE_AP != mode)
    {

        /* Switch to AP role and restart */
        ret = sl_WlanSetMode(ROLE_AP);
        ASSERT_ON_ERROR(ret);

        ret = sl_Stop(SL_STOP_TIMEOUT );
        ASSERT_ON_ERROR(ret);

        ret = sl_Start(0, 0, 0);
        ASSERT_ON_ERROR(ret);

        /* Check if the device is in AP again */
        if (ROLE_AP != ret)
        {
            /* We don't want to proceed if the device is not coming up in AP mode */
            return -1;
        }
    }
    
    /* Set connection policy to Auto (no AutoProvisioning)  */
    ret = sl_WlanPolicySet(SL_WLAN_POLICY_CONNECTION,
                                SL_WLAN_CONNECTION_POLICY(1, 0, 0, 0), NULL, 0);
    ASSERT_ON_ERROR(ret);

    /* Remove all profiles */
    ret = sl_WlanProfileDel(0xFF);
    ASSERT_ON_ERROR(ret);

    /* Enable DHCP client */
    ret = sl_NetCfgSet(SL_NETCFG_IPV4_STA_ADDR_MODE,SL_NETCFG_ADDR_DHCP,0,0);
    ASSERT_ON_ERROR(ret);

    /* Disable IPV6 */
    ifBitmap = 0;
    ret = sl_NetCfgSet(SL_NETCFG_IF, SL_NETCFG_IF_STATE, sizeof(ifBitmap), (uint8_t *)&ifBitmap);
    ASSERT_ON_ERROR(ret);


    /* Disable scan */
    ucConfigOpt = SL_WLAN_SCAN_POLICY(0, 0);
    ret = sl_WlanPolicySet(SL_WLAN_POLICY_SCAN , ucConfigOpt, NULL, 0);
    ASSERT_ON_ERROR(ret);

    /* Set Tx power level for station mode
     Number between 0-15, as dB offset from max power - 0 will set max power */
    ucPower = 0;
    ret = sl_WlanSet(SL_WLAN_CFG_GENERAL_PARAM_ID,
                        SL_WLAN_GENERAL_PARAM_OPT_STA_TX_POWER, 1, (uint8_t *)&ucPower);
    ASSERT_ON_ERROR(ret);

    /* Set PM policy to normal */
    ret = sl_WlanPolicySet(SL_WLAN_POLICY_PM , SL_WLAN_NORMAL_POLICY, NULL, 0);
    ASSERT_ON_ERROR(ret);

    /* Unregister mDNS services */
    ret = sl_NetAppMDNSUnRegisterService(0, 0, 0);
    ASSERT_ON_ERROR(ret);

    /* Re-activate HTTP server as secured/non-secured */
    ret = ConfigureHttpServer();
    ASSERT_ON_ERROR(ret);

    /* Remove  all 64 filters (8*8) */
    memset(RxFilterIdMask.FilterBitmap, 0xFF, 8);
    ret = sl_WlanSet(SL_WLAN_RX_FILTERS_ID,
               SL_WLAN_RX_FILTER_REMOVE,
               sizeof(SlWlanRxFilterOperationCommandBuff_t),
               (uint8_t *)&RxFilterIdMask);
    ASSERT_ON_ERROR(ret);

    ret = sl_Stop(SL_STOP_TIMEOUT);
    ASSERT_ON_ERROR(ret);
    
    return ret;
}

#endif
//*****************************************************************************
//
//! \brief This function starts the SimpleLink in the configured role. 
//!         The device notifies the host asynchronously when the initialization is completed
//!
//! \param[in]  role    Device shall be configured in this role
//!
//! \return 0 on success, negative value otherwise
//!
//*****************************************************************************
static int32_t InitSimplelink(uint8_t const role)
{
    LocalOta_AppContext *const pCtx = &gAppCtx;
    int32_t retVal = -1;
#ifdef __MSP432P401R__
    int32_t ret = -1;
#endif

    pCtx->role = role;
    pCtx->currentState = LocalOtaState_Starting;
    pCtx->pendingEvents = 0;

    retVal = sl_Start(0, 0, 0); /* without using SimpleLinkInitCallback */
#ifdef __MSP432P401R__
    ret = ConfigureHttpServer();
    ASSERT_ON_ERROR(ret);
#endif
    if(pCtx->role == retVal)
    {
        UART_PRINT("[Local ota task] SimpleLinkInitCallback: started in role %d\n\r", pCtx->role);
        SignalEvent(LocalOtaEvent_Started);
    }
    else
    {
        UART_PRINT("[Local ota task] SimpleLinkInitCallback: started in role %d, set the requested role %d\n\r", retVal, pCtx->role);
        retVal = sl_WlanSetMode(pCtx->role);
        ASSERT_ON_ERROR(retVal);
        retVal = sl_Stop(SL_STOP_TIMEOUT);
        ASSERT_ON_ERROR(retVal);
        retVal = sl_Start(0, 0, 0);
        ASSERT_ON_ERROR(retVal);
        if (pCtx->role != retVal)
        {
            UART_PRINT("[Local ota task] SimpleLinkInitCallback: error setting role %d, status=%d\n\r", pCtx->role, retVal);
            SignalEvent(LocalOtaEvent_Error);
        }
        UART_PRINT("[Local ota task] SimpleLinkInitCallback: restarted in role %d\n\r", pCtx->role);
        pCtx->pendingEvents = 0;
        SignalEvent(LocalOtaEvent_Started);
    }

    /* Start timer */
    pCtx->asyncEvtTimeout = ASYNC_EVT_TIMEOUT;
    retVal = StartAsyncEvtTimer(pCtx->asyncEvtTimeout);
    ASSERT_ON_ERROR(retVal);

    return retVal;
}

//*****************************************************************************
//! \brief This function handles 'LocalOtaEvent_Started' event and kick off the procedure
//!
//! \param   none
//!
//! \return  On success, zero is returned. On error, negative is returned
//*****************************************************************************
static int32_t HandleStartConnect()
{
    SlDeviceVersion_t   firmwareVersion = {0};

    int32_t retVal     = -1;
    uint8_t  ucConfigOpt = 0;
    uint16_t ucConfigLen = 0;

    /* Get the device's version-information */
    ucConfigOpt = SL_DEVICE_GENERAL_VERSION;
    ucConfigLen = sizeof(firmwareVersion);
    retVal = sl_DeviceGet(SL_DEVICE_GENERAL, &ucConfigOpt, &ucConfigLen, (uint8_t *)(&firmwareVersion));
    ASSERT_ON_ERROR(retVal);

    UART_PRINT("[Local ota task] Host Driver Version: %s\n\r", SL_DRIVER_VERSION);
    UART_PRINT("Build Version %d.%d.%d.%d.31.%d.%d.%d.%d.%d.%d.%d.%d\n\r",\
               firmwareVersion.NwpVersion[0], firmwareVersion.NwpVersion[1],\
               firmwareVersion.NwpVersion[2], firmwareVersion.NwpVersion[3],\
                firmwareVersion.FwVersion[0], firmwareVersion.FwVersion[1],\
                firmwareVersion.FwVersion[2], firmwareVersion.FwVersion[3],\
                firmwareVersion.PhyVersion[0], firmwareVersion.PhyVersion[1],\
                firmwareVersion.PhyVersion[2], firmwareVersion.PhyVersion[3]);

    retVal = StartConnection();
    ASSERT_ON_ERROR(retVal);

    return retVal;
}

//*****************************************************************************
//! \brief This function initiates a connection request
//!
//! \param   none
//!
//! \return  On success, zero is returned. On error, negative is returned
//*****************************************************************************
static int32_t StartConnection()
{
    SlWlanSecParams_t secParams = {0};
    int32_t retVal = 0;

