onepas/cc3220-examples/rtos/CC3220SF_LAUNCHXL/demos/local_ota/local_ota_task.c
    secParams.Key = (signed char*)SECURITY_KEY;
    secParams.KeyLen = strlen(SECURITY_KEY);
    secParams.Type = SECURITY_TYPE;

    UART_PRINT("[Local ota task] WlanConnect SSID=%s\n\r", SSID_NAME);
    retVal = sl_WlanConnect((signed char*)SSID_NAME,\
                             strlen(SSID_NAME), 0, &secParams, 0);
    ASSERT_ON_ERROR(retVal);

    retVal = StartAsyncEvtTimer(ASYNC_EVT_TIMEOUT);
    ASSERT_ON_ERROR(retVal);

    return retVal;
}


//*****************************************************************************
//! \brief This function starts timer for IP address acquisition
//!
//! \param   none
//!
//! \return  On success, zero is returned. On error, negative is returned
//*****************************************************************************
static int32_t WaitForIpAddr()
{
    int32_t retVal = 0;

    retVal = StartAsyncEvtTimer(ASYNC_EVT_TIMEOUT);
    ASSERT_ON_ERROR(retVal);

    return retVal;
}


//*****************************************************************************
//! \brief This function configures Simplelink to ping the gateway IP and check the LAN connection
//!
//! \param   none
//!
//! \return  On success, zero is returned. On error, negative is returned
//*****************************************************************************
static int32_t CheckLanConnection()
{
    LocalOta_AppContext *const pCtx = &gAppCtx;

    /* LAN connection acquired */
    GPIO_write(Board_LED0, Board_LED_ON);

    pCtx->ledIndex = Board_LED2;

    SlNetAppPingCommand_t pingParams = {0};
    SlNetAppPingReport_t pingReport = {0};

    int32_t retVal = -1;

    /* Set the ping parameters */
    pingParams.PingIntervalTime = PING_INTERVAL;
    pingParams.PingSize = PING_PKT_SIZE;
    pingParams.PingRequestTimeout = PING_TIMEOUT;
    pingParams.TotalNumberOfAttempts = NO_OF_ATTEMPTS;
    pingParams.Flags = 0;

    pingParams.Ip = LocalOta_ControlBlock.gatewayIP;

    /* Ping the GW */
    retVal = sl_NetAppPing((SlNetAppPingCommand_t*)&pingParams,\
                          SL_AF_INET, (SlNetAppPingReport_t*)&pingReport,\
                                SimpleLinkPingReport);
    ASSERT_ON_ERROR(retVal);

    /* Compute worst case ping timeout */
    pCtx->asyncEvtTimeout = ((NO_OF_ATTEMPTS * PING_TIMEOUT) +\
                             (NO_OF_ATTEMPTS * PING_INTERVAL) +\
                             (2000)); /* Additional time */
    
    retVal = StartAsyncEvtTimer(pCtx->asyncEvtTimeout);
    ASSERT_ON_ERROR(retVal);

    UART_PRINT("[Local ota task] Pinging gateway, please wait...\n\r");

    return retVal;
}



//*****************************************************************************
//
//! \brief This function starts the async-event timer
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//*****************************************************************************
static int32_t StartAsyncEvtTimer(uint32_t timeout)
{
    LocalOta_AppContext *const pCtx = &gAppCtx;

    pCtx->asyncEvtTimeout = timeout;
    Platform_TimerStart(pCtx->asyncEvtTimeout, gAsyncEventTimer, 0);
    return 0;
}

//*****************************************************************************
//
//! \brief This function stops the async-event timer
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//*****************************************************************************
static int32_t StopAsyncEvtTimer()
{
    LocalOta_AppContext *const pCtx = &gAppCtx;

    if(0 != pCtx->asyncEvtTimeout)
    {
        Platform_TimerStop(gAsyncEventTimer);
        pCtx->asyncEvtTimeout = 0;
    }

    return 0;
}


//*****************************************************************************
//
//! \brief report SM during local ota process
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//*****************************************************************************
static int32_t ReportSM()
{
    LocalOta_AppContext *const pCtx = &gAppCtx;
    uint16_t eventIdx = 0;

    for(eventIdx = 0; eventIdx < LocalOtaEvent_Max; eventIdx++)
    {
        if(0 != (pCtx->pendingEvents & (1 << eventIdx)))
        {
            break;
        }
    }

    UART_PRINT("[Local ota task] SM: State = %d, Event = %d\n\r",\
                                    pCtx->currentState, eventIdx);
    return 0;
}


//*****************************************************************************
//
//! \brief internal error detection during local ota process
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//*****************************************************************************
static int32_t ReportError()
{
    LocalOta_AppContext *const pCtx = &gAppCtx;
    uint16_t eventIdx = 0;

    for(eventIdx = 0; eventIdx < LocalOtaEvent_Max; eventIdx++)
    {
        if(0 != (pCtx->pendingEvents & (1 << eventIdx)))
        {
            break;
        }
    }

    UART_PRINT("[Local ota task] Unexpected SM: State = %d, Event = %d\n\r",\
                                    pCtx->currentState, eventIdx);
    return -1; 
}


//*****************************************************************************
//! \brief test for commit flag after ping is completed
//!          if commit is pending, try to commit.
//!          if commit is successful or no commit is required, continue to ota procedure.
//!          Upon unsuccessful commit, platform reboot is required.
//!
//! \param   none
//!
//! \return  On success, zero is returned. On error, negative is returned
//*****************************************************************************
static int32_t HandlePingComplete()
{
    int16_t isPendingCommit;

    StopLedEvtTimer();

    /* Turn on GREEN LED when device gets PING response from AP */
    GPIO_write(Board_LED2, Board_LED_ON);

    isPendingCommit = OtaArchive_GetPendingCommit();
    
    if (isPendingCommit)        /* validation of new ota bundle succeeded, commit the new ota bundle */
    {
        UART_PRINT("[Local ota task] committing new ota download... \n\r");
        if (OtaArchive_Commit() < 0)
        {
            UART_PRINT("[Local ota task] failed to commit new download, reverting to previous copy by reseting the device \n\r");
            SignalEvent(LocalOtaEvent_Restart);

            return -1;
        }
        UART_PRINT("[Local ota task] commit succeeded \n\r");

        /* need to stop the WDT so MCU is not reset */
#ifdef CC32XX
        PRCMPeripheralReset(PRCM_WDT);
#endif
    }

    UART_PRINT("[Local ota task] waiting for new ota upload... \n\r");

