onepas/cc3220-examples/rtos/CC3220SF_LAUNCHXL/demos/local_ota/local_ota_task.c
    /* signal to linklocal task */
    sem_post(&LocalOtaTask_ControlBlock.localOtaConnDoneSignal);

    /* signal to report server task */
    sem_post(&LocalOtaTask_ControlBlock.localOtaConnDoneToOtaServerSignal);

    return 0;
}


//*****************************************************************************
//
//! \brief This function stops the network processor and restarts the mcu
//!
//! \param[in]  None
//!
//! \return 0 on success
//!
//*****************************************************************************
static int32_t ProcessRestartMcu()
{
    mcuReboot();

    return 0;
}


//*****************************************************************************
//
//! \brief main local ota loop
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//*****************************************************************************
static int32_t localOtaAppTask()
{
    LocalOta_AppContext *const pCtx = &gAppCtx;
    s_TblEntry   *pEntry = NULL;
    uint16_t eventIdx = 0;

    for(eventIdx = 0; eventIdx < LocalOtaEvent_Max; eventIdx++)
    {
        if(0 != (pCtx->pendingEvents & (1 << eventIdx)))
        {
            if (0 != eventIdx)
            {
                /** Events received - Stop the respective timer if its still
                  * running
                  */
                StopAsyncEvtTimer();
            }

            pEntry = (s_TblEntry *)&gTransitionTable[pCtx->currentState][eventIdx];
            if (eventIdx == LocalOtaEvent_Timeout)
            {
                UART_PRINT("[Local ota task] Handle LocalOtaEvent_Timeout in state=%d, next=%d\n\r", pCtx->currentState, pEntry->nextState);
            }
            if (eventIdx == LocalOtaEvent_Error)
            {
                UART_PRINT("[Local ota task] Handle LocalOtaEvent_Error in state=%d, next=%d\n\r", pCtx->currentState, pEntry->nextState);
            }
            if (eventIdx == LocalOtaEvent_Restart)
            {
                UART_PRINT("[Local ota task] Handle LocalOtaEvent_Restart in state=%d, next=%d\n\r", pCtx->currentState, pEntry->nextState);
            }
            pCtx->pendingEvents &= ~(1 << eventIdx);
            if (NULL != pEntry->p_evtHndl)
            {
                if (pEntry->p_evtHndl() < 0)
                {
                    UART_PRINT("[Local ota task] Event handler failed..!! halt\n\r");
                    LOOP_FOREVER();
                }
            }
            
            if (pEntry->nextState != pCtx->currentState)
            {
                pCtx->currentState = pEntry->nextState;
            }

            pCtx->pendingEvents &= ~(1 << eventIdx);
        }

        /* No more events to handle. Break.! */
        if(0 == pCtx->pendingEvents) break;
    }

    usleep(1000);

    return 0;
}


//*****************************************************************************
//
//! Notify if device return to factory image
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
#ifdef CC32XX
static void NotifyReturnToFactoryImage()
{
    if(((HWREG(HIB3P3_BASE + 0x00000418) & (1<<7)) !=0) &&
        ((HWREG(0x4402F0C8) &0x01) != 0))
    {
        UART_PRINT("Return To Factory Image successful, Do a power cycle(POR)"
                    " of the device using switch SW1-Reset\n\r");
        while(1);
    }
}
#endif
//*****************************************************************************
//                            MAIN FUNCTION
//*****************************************************************************

//*****************************************************************************
//
//! \brief The interrupt handler for the async-evt timer
//!
//! \param[in]  None
//!
//! \return None
//!
//*****************************************************************************
int16_t SignalEvent(LocalOtaEvent event)
{
    LocalOta_AppContext *const pCtx = &gAppCtx;
    pCtx->pendingEvents |= (1 << event);
    return 0;
}

//*****************************************************************************
//
//! \brief This function starts the led toggling timer
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//*****************************************************************************
int32_t StartLedEvtTimer(uint32_t timeout)
{
    LocalOta_AppContext *const pCtx = &gAppCtx;

    pCtx->ledToggleTimeout = timeout;
    Platform_TimerStart(pCtx->ledToggleTimeout, gLedTimer, 1);
    
    return 0;
}

//*****************************************************************************
//
//! \brief This function stops the led toggling timer
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//*****************************************************************************
int32_t StopLedEvtTimer()
{
    LocalOta_AppContext *const pCtx = &gAppCtx;

    if(0 != pCtx->ledToggleTimeout)
    {
        Platform_TimerStop(gLedTimer);
        pCtx->ledToggleTimeout = 0;
    }

    return 0;
}


//*****************************************************************************
//
//! \brief This is the main local ota task
//!
//! \param[in]  None
//!
//! \return None
//!
//*****************************************************************************
void * localOtaTask(void *pvParameters)
{
    int32_t            retVal = -1;
    LocalOta_AppContext     *const pCtx = &gAppCtx;
    
#ifdef CC32XX
    /* Check the wakeup source. If first time entry or wakeup from HIB */
    if(MAP_PRCMSysResetCauseGet() == 0)
    {
        UART_PRINT("[Local ota task] Wake up on Power ON\n\r");
    }
    else if(MAP_PRCMSysResetCauseGet() == PRCM_HIB_EXIT)
    {
        UART_PRINT("[Local ota task] Woken up from Hibernate\n\r");
    }
#endif
    /* Configure toggle LEDs  */
    GPIO_write(Board_LED0, Board_LED_OFF);
    GPIO_write(Board_LED1, Board_LED_OFF);
    GPIO_write(Board_LED2, Board_LED_OFF);

    Platform_TimerInit(AsyncEvtTimerIntHandler, &gAsyncEventTimer);
    Platform_TimerInit(LedTimerIntHandler, &gLedTimer);

    /* Set the LED toggling timeout and index before starting the timer */
    pCtx->ledIndex = Board_LED0;
    pCtx->ledToggleTimeout = LED_TOGGLE_TIMEOUT;

    StartLedEvtTimer(pCtx->ledToggleTimeout);
#ifdef CC32XX
    /* check whether return-to-default occured */
    NotifyReturnToFactoryImage();

    /*
         IMPORTANT NOTE - This is an example reset function, user must update
                          this function to match the application settings.
    */
    retVal = ConfigureSimpleLinkToDefaultState();
    if(retVal < 0)
    {
        UART_PRINT("[Local ota task] Failed to configure the device in its default state.., halt\n\r");
        LOOP_FOREVER();
    }

    UART_PRINT("[Local ota task] Device is configured in default state \n\r");
#endif
    /* Configure SimpleLink in STATION role */
    retVal = InitSimplelink(ROLE_STA);
    if(retVal < 0)
    {
        UART_PRINT("[Local ota task] Failed to initialize the device!!, halt\n\r");
        LOOP_FOREVER();
    }
    getDeviceType();
    do
    {
        retVal = localOtaAppTask();

    }while(!retVal); /* Exit on failure */

    return(0);
}
//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
